chauhanaman471/HumanMotionDetection/PSOC+MATLAB/Software/Lab03_Lab04/Motion_Detection.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "User_Button_aliases.h"
#include "User_Button.h"
#include "Clock_Debouncer.h"
#include "isr_Button.h"
#include "Red_LED_aliases.h"
#include "Red_LED.h"
#include "Yellow_LED_aliases.h"
#include "Yellow_LED.h"
#include "Green_LED_aliases.h"
#include "Green_LED.h"
#include "WaveDAC8_1.h"
#include "DAC_aliases.h"
#include "DAC.h"
#include "UART_1.h"
#include "ADC_DelSig_1.h"
#include "ADC_IN_aliases.h"
#include "ADC_IN.h"
#include "isr_adc.h"
#include "isr_rx.h"
#include "WaveDAC8_1_DacClk.h"
#include "WaveDAC8_1_Wave1_DMA_dma.h"
#include "WaveDAC8_1_Wave2_DMA_dma.h"
#include "WaveDAC8_1_VDAC8.h"
#include "UART_1_IntClock.h"
#include "ADC_DelSig_1_AMux.h"
#include "ADC_DelSig_1_Ext_CP_Clk.h"
#include "ADC_DelSig_1_IRQ.h"
#include "ADC_DelSig_1_theACLK.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

